import React from 'react';
import {
  HashRouter as Router,
  Switch,
  Route,
  Redirect,
} from 'react-router-dom';
import Layout from './components/Layout';

function App() {
  return (
    <Router>
      <Switch>
        <Route path="/tags">
          <Tags/>
        </Route>
        <Route path="/money">
          <Money/>
        </Route>
        <Route path="/statistics">
          <Statistics/>
        </Route>
        <Redirect exact from="/" to="/money"/>
        <Route path="*">
          <NoMatch/>
        </Route>
      </Switch>
    </Router>
  );
}

function Statistics() {
  return (
    <Layout>
      <h2>统计页</h2>
    </Layout>
  );
}

function Tags() {
  return (
    <Layout>
      <h2>标签页面</h2>
    </Layout>
  );
}

function Money() {
  return (
    <Layout>
      <h2>记账页面</h2>
    </Layout>
  );
}

function NoMatch() {
  return <h2>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
    <p>你输入了一个根本不存在在系统中的地址！</p>
  </h2>;
}

export default App;
